app/helpers/sessions_helper.rb

UPDATE "users" SET "updated_at" = $1, "token" = $2 WHERE "users"."id" = $3  [["updated_at", "2018-09-28 13:26:38.465650"], ["token", "854ae66d9c7f3b39f85f3df5a0fbcdeddb96560c"], ["id", 10]]
---
	def sign_in(user)
		token = User.new_token
		cookies.permanent[:token] = token
		user.update_attribute(:token,User.digest(token))

UPDATE "users" SET "token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["token", "3d4bfc62615436b48d6d511535e44f00f8a4310f"], ["updated_at", "2018-09-28 13:26:25.864991"], ["id", 1]]
---
	def sign_out
		current_user.update_attribute(:token,User.digest(User.new_token))

SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "6dc231ccd67f4fc343131b15d7b6ec55051a233e"], ["LIMIT", 1]]
---
	def current_user
		token = User.digest(cookies.permanent[:token])
		@current_user ||= User.find_by(token: token)